#include "Function.hpp"

int main()
{
//Розробіть клас для динамічного масиву ( або вектору, якщо вмієте ним користуватися), який містить масив елементів. Перевантажте оператор [], щоб можна було звертатися до елементів вектора за індексом як для виводу, так і для зміни елементів (всього 2 перевантаження).
//Перевантажте оператор присвоювання =, щоб він правильно копіював дані з одного
    
    
    Conteiner text1;
    text1.addElement(Element("audi", "sedan","black"));
    cout<<text1[0];
    cout<<endl;
    text1[0] = Element("bmw", "sedan", "white");
    cout<<text1[0];
    
    
//Завдання 2 (Словник)
//Словник: Реалізуйте клас словника, який зберігає слова та їх відповідні значення.
//Перегрузіть оператор [], щоб можна було отримувати значення, шукаючи слово за його ключем, наприклад, dictionary["word"]
    
    Dictionary DictionaryCars;
    DictionaryCars.addWord(Item("Mercedes-Benz", "Известная своим роскошным стилем и передовыми технологиями, Mercedes-Benz производит широкий спектр автомобилей, включая роскошные седаны, спортивные купе и внедорожники."));
    DictionaryCars.addWord(Item("BMW", "BMW славится своими динамичными автомобилями, которые сочетают в себе спортивные характеристики с комфортом и технологическими инновациями."));
    DictionaryCars.addWord(Item("Audi", "Audi известен своим изысканным дизайном, высоким качеством сборки и передовыми системами безопасности и развлечений."));
    DictionaryCars.addWord(Item("Volkswagen", "Видимо, самый известный бренд массового автопрома Германии, Volkswagen предлагает широкий спектр автомобилей, от экономичных моделей до премиум-класса."));
    DictionaryCars.addWord(Item("Porsche", "Porsche знаменит своими спортивными автомобилями высшего класса, которые сочетают в себе выдающуюся производительность и роскошный дизайн."));
    
        
        try {
            cout<<DictionaryCars["BMW"];
            cout<<DictionaryCars["Audi"];
        } catch (const out_of_range& e) {
            cout << e.what() << endl;
        }
}
